count = 0
c = {}
text = """Алгоритм PageRank использовался для создания поисковой системы Google. 
Алгоритм назначает каждой странице ранг, основанный на количестве входящих ссылок. 
Он получает одно входное значение: список страниц, ссылающихся на другие страницы. 
Каждой странице изначально назначается ранг 1. 
Выполняется несколько итераций алгоритма — обычно 10."""
text = text.split()
for i in text:
    for j in text:
        if i == j:
            count = count + 1
            c[i] = (count)

    count = 0

print("Колво повторений каждого слова: "+c)
